MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HLFDAUG/mcu.h
#define TSB_TSEL0_CR15_EN60                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,0)))
#define TSB_TSEL0_CR15_OUTSEL60                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,1)))
#define TSB_TSEL0_CR15_UPDN60                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,2)))
#define TSB_TSEL0_CR15_EN61                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,8)))
#define TSB_TSEL0_CR15_OUTSEL61                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,9)))
#define TSB_TSEL0_CR15_UPDN61                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,10)))
#define TSB_TSEL0_CR15_EN62                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,16)))
#define TSB_TSEL0_CR15_OUTSEL62                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,17)))
#define TSB_TSEL0_CR15_UPDN62                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,18)))
#define TSB_TSEL0_CR15_EN63                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,24)))
#define TSB_TSEL0_CR15_OUTSEL63                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,25)))
#define TSB_TSEL0_CR15_UPDN63                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL0->CR15,26)))

#define TSB_TSEL1_CR0_EN0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,0)))
#define TSB_TSEL1_CR0_OUTSEL0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,1)))
#define TSB_TSEL1_CR0_UPDN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,2)))
#define TSB_TSEL1_CR0_EN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,8)))
#define TSB_TSEL1_CR0_OUTSEL1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,9)))
#define TSB_TSEL1_CR0_UPDN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,10)))
#define TSB_TSEL1_CR0_EN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,16)))
#define TSB_TSEL1_CR0_OUTSEL2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,17)))
#define TSB_TSEL1_CR0_UPDN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,18)))
#define TSB_TSEL1_CR0_EN3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,24)))
#define TSB_TSEL1_CR0_OUTSEL3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,25)))
#define TSB_TSEL1_CR0_UPDN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR0,26)))
#define TSB_TSEL1_CR1_EN4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,0)))
#define TSB_TSEL1_CR1_OUTSEL4                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,1)))
#define TSB_TSEL1_CR1_UPDN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,2)))
#define TSB_TSEL1_CR1_EN5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,8)))
#define TSB_TSEL1_CR1_OUTSEL5                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,9)))
#define TSB_TSEL1_CR1_UPDN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,10)))
#define TSB_TSEL1_CR1_EN6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,16)))
#define TSB_TSEL1_CR1_OUTSEL6                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,17)))
#define TSB_TSEL1_CR1_UPDN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,18)))
#define TSB_TSEL1_CR1_EN7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,24)))
#define TSB_TSEL1_CR1_OUTSEL7                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,25)))
#define TSB_TSEL1_CR1_UPDN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR1,26)))
#define TSB_TSEL1_CR2_EN8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,0)))
#define TSB_TSEL1_CR2_OUTSEL8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,1)))
#define TSB_TSEL1_CR2_UPDN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,2)))
#define TSB_TSEL1_CR2_EN9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,8)))
#define TSB_TSEL1_CR2_OUTSEL9                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,9)))
#define TSB_TSEL1_CR2_UPDN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,10)))
#define TSB_TSEL1_CR2_EN10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,16)))
#define TSB_TSEL1_CR2_OUTSEL10                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,17)))
#define TSB_TSEL1_CR2_UPDN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,18)))
#define TSB_TSEL1_CR2_EN11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,24)))
#define TSB_TSEL1_CR2_OUTSEL11                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,25)))
#define TSB_TSEL1_CR2_UPDN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR2,26)))
#define TSB_TSEL1_CR3_EN12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,0)))
#define TSB_TSEL1_CR3_OUTSEL12                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,1)))
#define TSB_TSEL1_CR3_UPDN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,2)))
#define TSB_TSEL1_CR3_EN13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,8)))
#define TSB_TSEL1_CR3_OUTSEL13                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,9)))
#define TSB_TSEL1_CR3_UPDN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,10)))
#define TSB_TSEL1_CR3_EN14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,16)))
#define TSB_TSEL1_CR3_OUTSEL14                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,17)))
#define TSB_TSEL1_CR3_UPDN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,18)))
#define TSB_TSEL1_CR3_EN15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,24)))
#define TSB_TSEL1_CR3_OUTSEL15                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,25)))
#define TSB_TSEL1_CR3_UPDN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR3,26)))
#define TSB_TSEL1_CR4_EN16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,0)))
#define TSB_TSEL1_CR4_OUTSEL16                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,1)))
#define TSB_TSEL1_CR4_UPDN16                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,2)))
#define TSB_TSEL1_CR4_EN17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,8)))
#define TSB_TSEL1_CR4_OUTSEL17                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,9)))
#define TSB_TSEL1_CR4_UPDN17                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,10)))
#define TSB_TSEL1_CR4_EN18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,16)))
#define TSB_TSEL1_CR4_OUTSEL18                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,17)))
#define TSB_TSEL1_CR4_UPDN18                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,18)))
#define TSB_TSEL1_CR4_EN19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,24)))
#define TSB_TSEL1_CR4_OUTSEL19                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,25)))
#define TSB_TSEL1_CR4_UPDN19                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR4,26)))
#define TSB_TSEL1_CR5_EN20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,0)))
#define TSB_TSEL1_CR5_OUTSEL20                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,1)))
#define TSB_TSEL1_CR5_UPDN20                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,2)))
#define TSB_TSEL1_CR5_EN21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,8)))
#define TSB_TSEL1_CR5_OUTSEL21                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,9)))
#define TSB_TSEL1_CR5_UPDN21                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,10)))
#define TSB_TSEL1_CR5_EN22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,16)))
#define TSB_TSEL1_CR5_OUTSEL22                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,17)))
#define TSB_TSEL1_CR5_UPDN22                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,18)))
#define TSB_TSEL1_CR5_EN23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,24)))
#define TSB_TSEL1_CR5_OUTSEL23                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,25)))
#define TSB_TSEL1_CR5_UPDN23                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR5,26)))
#define TSB_TSEL1_CR6_EN24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,0)))
#define TSB_TSEL1_CR6_OUTSEL24                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,1)))
#define TSB_TSEL1_CR6_UPDN24                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,2)))
#define TSB_TSEL1_CR6_EN25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,8)))
#define TSB_TSEL1_CR6_OUTSEL25                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,9)))
#define TSB_TSEL1_CR6_UPDN25                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,10)))
#define TSB_TSEL1_CR6_EN26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,16)))
#define TSB_TSEL1_CR6_OUTSEL26                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,17)))
#define TSB_TSEL1_CR6_UPDN26                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,18)))
#define TSB_TSEL1_CR6_EN27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,24)))
#define TSB_TSEL1_CR6_OUTSEL27                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,25)))
#define TSB_TSEL1_CR6_UPDN27                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR6,26)))
#define TSB_TSEL1_CR7_EN28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,0)))
#define TSB_TSEL1_CR7_OUTSEL28                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,1)))
#define TSB_TSEL1_CR7_UPDN28                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,2)))
#define TSB_TSEL1_CR7_EN29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,8)))
#define TSB_TSEL1_CR7_OUTSEL29                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,9)))
#define TSB_TSEL1_CR7_UPDN29                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,10)))
#define TSB_TSEL1_CR7_EN30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,16)))
#define TSB_TSEL1_CR7_OUTSEL30                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,17)))
#define TSB_TSEL1_CR7_UPDN30                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,18)))
#define TSB_TSEL1_CR7_EN31                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,24)))
#define TSB_TSEL1_CR7_OUTSEL31                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,25)))
#define TSB_TSEL1_CR7_UPDN31                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR7,26)))
#define TSB_TSEL1_CR8_EN32                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,0)))
#define TSB_TSEL1_CR8_OUTSEL32                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,1)))
#define TSB_TSEL1_CR8_UPDN32                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,2)))
#define TSB_TSEL1_CR8_EN33                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,8)))
#define TSB_TSEL1_CR8_OUTSEL33                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,9)))
#define TSB_TSEL1_CR8_UPDN33                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,10)))
#define TSB_TSEL1_CR8_EN34                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,16)))
#define TSB_TSEL1_CR8_OUTSEL34                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,17)))
#define TSB_TSEL1_CR8_UPDN34                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,18)))
#define TSB_TSEL1_CR8_EN35                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,24)))
#define TSB_TSEL1_CR8_OUTSEL35                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,25)))
#define TSB_TSEL1_CR8_UPDN35                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR8,26)))
#define TSB_TSEL1_CR9_EN36                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,0)))
#define TSB_TSEL1_CR9_OUTSEL36                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,1)))
#define TSB_TSEL1_CR9_UPDN36                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,2)))
#define TSB_TSEL1_CR9_EN37                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,8)))
#define TSB_TSEL1_CR9_OUTSEL37                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,9)))
#define TSB_TSEL1_CR9_UPDN37                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,10)))
#define TSB_TSEL1_CR9_EN38                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,16)))
#define TSB_TSEL1_CR9_OUTSEL38                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,17)))
#define TSB_TSEL1_CR9_UPDN38                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,18)))
#define TSB_TSEL1_CR9_EN39                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,24)))
#define TSB_TSEL1_CR9_OUTSEL39                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,25)))
#define TSB_TSEL1_CR9_UPDN39                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR9,26)))
#define TSB_TSEL1_CR10_EN40                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,0)))
#define TSB_TSEL1_CR10_OUTSEL40                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,1)))
#define TSB_TSEL1_CR10_UPDN40                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,2)))
#define TSB_TSEL1_CR10_EN41                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,8)))
#define TSB_TSEL1_CR10_OUTSEL41                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,9)))
#define TSB_TSEL1_CR10_UPDN41                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,10)))
#define TSB_TSEL1_CR10_EN42                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,16)))
#define TSB_TSEL1_CR10_OUTSEL42                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,17)))
#define TSB_TSEL1_CR10_UPDN42                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,18)))
#define TSB_TSEL1_CR10_EN43                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,24)))
#define TSB_TSEL1_CR10_OUTSEL43                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,25)))
#define TSB_TSEL1_CR10_UPDN43                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR10,26)))
#define TSB_TSEL1_CR11_EN44                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,0)))
#define TSB_TSEL1_CR11_OUTSEL44                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,1)))
#define TSB_TSEL1_CR11_UPDN44                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,2)))
#define TSB_TSEL1_CR11_EN45                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,8)))
#define TSB_TSEL1_CR11_OUTSEL45                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,9)))
#define TSB_TSEL1_CR11_UPDN45                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,10)))
#define TSB_TSEL1_CR11_EN46                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,16)))
#define TSB_TSEL1_CR11_OUTSEL46                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,17)))
#define TSB_TSEL1_CR11_UPDN46                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,18)))
#define TSB_TSEL1_CR11_EN47                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,24)))
#define TSB_TSEL1_CR11_OUTSEL47                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,25)))
#define TSB_TSEL1_CR11_UPDN47                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR11,26)))
#define TSB_TSEL1_CR12_EN48                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,0)))
#define TSB_TSEL1_CR12_OUTSEL48                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,1)))
#define TSB_TSEL1_CR12_UPDN48                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,2)))
#define TSB_TSEL1_CR12_EN49                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,8)))
#define TSB_TSEL1_CR12_OUTSEL49                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,9)))
#define TSB_TSEL1_CR12_UPDN49                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,10)))
#define TSB_TSEL1_CR12_EN50                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,16)))
#define TSB_TSEL1_CR12_OUTSEL50                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,17)))
#define TSB_TSEL1_CR12_UPDN50                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,18)))
#define TSB_TSEL1_CR12_EN51                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,24)))
#define TSB_TSEL1_CR12_OUTSEL51                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,25)))
#define TSB_TSEL1_CR12_UPDN51                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR12,26)))
#define TSB_TSEL1_CR13_EN52                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,0)))
#define TSB_TSEL1_CR13_OUTSEL52                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,1)))
#define TSB_TSEL1_CR13_UPDN52                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,2)))
#define TSB_TSEL1_CR13_EN53                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,8)))
#define TSB_TSEL1_CR13_OUTSEL53                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,9)))
#define TSB_TSEL1_CR13_UPDN53                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,10)))
#define TSB_TSEL1_CR13_EN54                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,16)))
#define TSB_TSEL1_CR13_OUTSEL54                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,17)))
#define TSB_TSEL1_CR13_UPDN54                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,18)))
#define TSB_TSEL1_CR13_EN55                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,24)))
#define TSB_TSEL1_CR13_OUTSEL55                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,25)))
#define TSB_TSEL1_CR13_UPDN55                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR13,26)))
#define TSB_TSEL1_CR14_EN56                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,0)))
#define TSB_TSEL1_CR14_OUTSEL56                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,1)))
#define TSB_TSEL1_CR14_UPDN56                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,2)))
#define TSB_TSEL1_CR14_EN57                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,8)))
#define TSB_TSEL1_CR14_OUTSEL57                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,9)))
#define TSB_TSEL1_CR14_UPDN57                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,10)))
#define TSB_TSEL1_CR14_EN58                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,16)))
#define TSB_TSEL1_CR14_OUTSEL58                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,17)))
#define TSB_TSEL1_CR14_UPDN58                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,18)))
#define TSB_TSEL1_CR14_EN59                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,24)))
#define TSB_TSEL1_CR14_OUTSEL59                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,25)))
#define TSB_TSEL1_CR14_UPDN59                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR14,26)))
#define TSB_TSEL1_CR15_EN60                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,0)))
#define TSB_TSEL1_CR15_OUTSEL60                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,1)))
#define TSB_TSEL1_CR15_UPDN60                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,2)))
#define TSB_TSEL1_CR15_EN61                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,8)))
#define TSB_TSEL1_CR15_OUTSEL61                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,9)))
#define TSB_TSEL1_CR15_UPDN61                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,10)))
#define TSB_TSEL1_CR15_EN62                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,16)))
#define TSB_TSEL1_CR15_OUTSEL62                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,17)))
#define TSB_TSEL1_CR15_UPDN62                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,18)))
#define TSB_TSEL1_CR15_EN63                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,24)))
#define TSB_TSEL1_CR15_OUTSEL63                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,25)))
#define TSB_TSEL1_CR15_UPDN63                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_TSEL1->CR15,26)))


